package Practice.PracticeTWo;

public class PracticeTwo {
    public static void main(String[] args) {
        /** 1) Создать два класса Cat и Dog.
         *  2) В каждом классе создать пременные, которые должны хранить имя и возраст
         *  3) Значения необходимо передавать через конструктор.
         *  4) Кроме того, создать методы, которые будут выводить консоль описание каких-либо действий, например: метод eat() выводить "Барсик кушает!"
         *  5*) Создать метод позволяющий изменить имя или возраст питомца. Данный метод необходимо реализовать в классе Cat и Dog.
         *      Вызов метода происходит в методе main().  */
    }
}
